{
    "start": "root",
    "nodes": {
        "root": {
            "speaker": "Dad",
            "text": "Hey, sport. How's the homework going? You need any help? I was pretty good at math back in the day. ...Before they changed it.",
            "choices": [
                {
                    "text": "Actually yeah, could you help me with calc? I'm stuck on—",
                    "effects": {
                        "dad_connection": 8,
                        "authenticity": 3,
                        "gpa": 2
                    },
                    "internal_monologue": "(Dad pulls out reading glasses he bought at CVS. He squints at the textbook for 10 minutes. He cannot help with calc. The attempt is the point.)",
                    "next": "dad_tries_math"
                },
                {
                    "text": "I'm good, Dad. Got it handled.",
                    "effects": {
                        "dad_connection": -3
                    },
                    "internal_monologue": "(He nods and goes back to the garage. The garage is where dads go to feel things without witnesses.)",
                    "next": "dad_garage"
                },
                {
                    "text": "Can we talk later? I need to finish this essay and prep for SATs.",
                    "effects": {
                        "dad_connection": -5,
                        "gpa": 3
                    },
                    "internal_monologue": "(Dad says 'sure thing, champ' in a voice that's 4% sadder than usual. You clock it. You file it under 'things to feel bad about later.')",
                    "next": null
                }
            ]
        },
        "dad_tries_math": {
            "speaker": "Dad",
            "text": "Okay so this is... a derivative? We didn't have these. We had long division and grit. ...I think you carry the 2?",
            "choices": [
                {
                    "text": "That's not how derivatives work, Dad. But thanks for trying.",
                    "effects": {
                        "dad_connection": 5,
                        "authenticity": 2
                    },
                    "internal_monologue": "(He laughs. You laugh. For a second neither of you is thinking about college applications. These seconds are expensive and you're spending them freely.)",
                    "next": "dad_real_talk"
                },
                {
                    "text": "You know what, I think I'll just watch a YouTube video. Thanks though.",
                    "effects": {
                        "dad_connection": -2
                    },
                    "internal_monologue": "(The light behind his eyes dims exactly one f-stop. YouTubers are replacing dads and everyone is pretending not to notice.)",
                    "next": null
                }
            ]
        },
        "dad_garage": {
            "speaker": "Dad",
            "text": "Alright. I'll be in the garage if you need anything. I'm organizing the... tools. The tool organizing.",
            "choices": [
                {
                    "text": "Hey Dad — actually, wanna grab burgers later? Just us?",
                    "effects": {
                        "dad_connection": 12,
                        "authenticity": 5
                    },
                    "internal_monologue": "(His entire face changes. Like someone turned on a lamp inside his skull. You wonder when the last time someone asked him to hang out was.)",
                    "next": "dad_burgers"
                },
                {
                    "text": "Okay. See you at dinner.",
                    "effects": {
                        "dad_connection": -1
                    },
                    "internal_monologue": "(Dinner will be eaten in shifts. Mom made chicken. Dad will eat standing up in the kitchen. Nobody acknowledges this is weird because it's been this way for 3 years.)",
                    "next": null
                }
            ]
        },
        "dad_real_talk": {
            "speaker": "Dad",
            "text": "You know... your mom and I didn't go to fancy schools. We turned out okay. I think. I mean, the garage is organized. That's something.",
            "choices": [
                {
                    "text": "You turned out great, Dad.",
                    "effects": {
                        "dad_connection": 10,
                        "authenticity": 5
                    },
                    "internal_monologue": "(He blinks twice fast. That's Dad for a standing ovation. You won't understand how much this moment meant to him until you're 35 and organizing your own garage.)",
                    "next": null
                },
                {
                    "text": "I want more, though. You get that, right?",
                    "effects": {
                        "dad_connection": -3,
                        "prestige": 3,
                        "authenticity": -3
                    },
                    "internal_monologue": "(He flinches, but he hides it well. 'More' is a word that sounds like ambition but tastes like rejection.)",
                    "next": null
                }
            ]
        },
        "dad_burgers": {
            "speaker": "Dad",
            "text": "Really? Yeah! I know a place. Well, it's the only place, but it's good. They know my order. Is that cool or sad?",
            "choices": [
                {
                    "text": "That's extremely cool, Dad.",
                    "effects": {
                        "dad_connection": 8,
                        "authenticity": 8
                    },
                    "internal_monologue": "(It is, objectively, a little bit of both. But tonight it's cool. Tonight everything is cool. The fries are perfect and your dad is doing his impression of his boss and you are laughing until Coke comes out your nose. File this one in 'permanent.')",
                    "next": null
                }
            ]
        }
    }
}