{
    "start": "root",
    "nodes": {
        "root": {
            "speaker": "Jordan",
            "text": "Yo. I made pasta. There's extra if you want. Also I learned to juggle today. Wanna see?",
            "choices": [
                {
                    "text": "You learned to JUGGLE? Show me immediately.",
                    "effects": {
                        "jordan_connection": 10,
                        "authenticity": 5
                    },
                    "internal_monologue": "(Jordan drops all three oranges within 4 seconds. You both laugh for 2 minutes straight. This is the best ratio of effort to joy you'll experience in your entire life. You'll never optimize for it because it can't be optimized.)",
                    "next": "jordan_juggle"
                },
                {
                    "text": "Can't right now, I have to prep for a test. Rain check?",
                    "effects": {
                        "jordan_connection": -4,
                        "gpa": 2
                    },
                    "internal_monologue": "(Jordan shrugs. Jordan always shrugs. Jordan's life is a series of shrugs that somehow feel more honest than all your planning.)",
                    "next": "jordan_shrug"
                },
                {
                    "text": "Juggling? Shouldn't you be studying? You have finals too.",
                    "effects": {
                        "jordan_connection": -8,
                        "authenticity": -5
                    },
                    "internal_monologue": "(You just sounded exactly like the worst version of yourself. Jordan knows it too. The look they give you is the look you'll eventually see in a mirror in Act IV.)",
                    "next": "jordan_hurt"
                }
            ]
        },
        "jordan_juggle": {
            "speaker": "Jordan",
            "text": "WAIT WAIT I almost— nope. Okay one more try. ...Nope. You know what, juggling is overrated. Wanna just eat pasta and watch something dumb?",
            "choices": [
                {
                    "text": "Absolutely. Queue up something terrible.",
                    "effects": {
                        "jordan_connection": 12,
                        "authenticity": 8
                    },
                    "internal_monologue": "(You watch 3 episodes of a show about people who think they can sing but can't. Jordan does commentary. You eat too much pasta. Your phone buzzes with a study group text. You ignore it. This is the correct choice and you'll never be rewarded for it.)",
                    "next": null
                },
                {
                    "text": "I should actually get back to studying. But the juggling was great.",
                    "effects": {
                        "jordan_connection": 2,
                        "gpa": 2
                    },
                    "internal_monologue": "(Jordan says 'no worries!' and means it. Jordan always means it. That's the difference between you two and you're not sure which side is better.)",
                    "next": null
                }
            ]
        },
        "jordan_shrug": {
            "speaker": "Jordan",
            "text": "Yeah sure. Hey — you're like, really stressed lately. You know that, right? Like... MORE stressed than normal. And your normal is already a lot.",
            "choices": [
                {
                    "text": "I'm fine. This is just how it is right now.",
                    "effects": {
                        "jordan_connection": -3,
                        "authenticity": -3
                    },
                    "internal_monologue": "('Fine' is doing the heaviest lifting of any 4-letter word in the English language.)",
                    "next": null
                },
                {
                    "text": "...Yeah. I know. I don't know how to stop though.",
                    "effects": {
                        "jordan_connection": 10,
                        "authenticity": 8,
                        "burnout": -5
                    },
                    "internal_monologue": "(Jordan doesn't try to fix it. Doesn't offer advice. Just says 'that sucks.' It's the most helpful thing anyone has said to you in weeks.)",
                    "next": "jordan_honest"
                }
            ]
        },
        "jordan_hurt": {
            "speaker": "Jordan",
            "text": "...Wow. Okay. I'm gonna go eat my pasta in my room. Have fun being you.",
            "choices": [
                {
                    "text": "Jordan, wait, I didn't mean—",
                    "effects": {
                        "jordan_connection": 2
                    },
                    "internal_monologue": "(They're already gone. The door closes with exactly the right amount of pressure to communicate 'I'm not slamming it but I want you to know I could.' Sibling door physics are an art form.)",
                    "next": null
                }
            ]
        },
        "jordan_honest": {
            "speaker": "Jordan",
            "text": "You know what I think? I think you're scared that if you stop for even a second, you'll fall behind. But behind what? Like... behind WHO?",
            "choices": [
                {
                    "text": "...I don't know. Everyone? The idea of where I should be?",
                    "effects": {
                        "jordan_connection": 8,
                        "authenticity": 10
                    },
                    "internal_monologue": "(Jordan just asked the second most important question in this game. The first is 'was it worth it?' You won't get to that one for a while.)",
                    "next": null
                },
                {
                    "text": "It's not that simple, Jordan. You wouldn't understand.",
                    "effects": {
                        "jordan_connection": -10,
                        "authenticity": -5,
                        "prestige": 2
                    },
                    "internal_monologue": "(Jordan understands perfectly. That's what terrifies you.)",
                    "next": null
                }
            ]
        }
    }
}