{
    "id": "act3_mom",
    "character": "Mom",
    "context": "Mom calls on Sundays. You're at your desk.",
    "nodes": {
        "start": {
            "speaker": "Mom",
            "text": "Hi sweetie! Are you eating enough? Your father is making the turkey this year. He watched a YouTube video. I'm scared.",
            "internal": "(She calls every Sunday. You pick up every third one. She pretends not to notice.)",
            "choices": [
                {
                    "text": "Hey Mom, yeah I'm eating fine. Tell Dad to use a thermometer this time.",
                    "effects": {
                        "relationship": {
                            "mom": 8
                        },
                        "authenticity": 3
                    },
                    "next": "turkey_advice"
                },
                {
                    "text": "Hey Mom — sorry, can I call you back? I'm just finishing something up.",
                    "internal": "(You won't call back. She knows you won't call back.)",
                    "effects": {
                        "relationship": {
                            "mom": -5
                        },
                        "burnout": -2
                    },
                    "next": "call_back"
                },
                {
                    "text": "Mom, I've been meaning to ask — is Dad okay? He seemed off last time.",
                    "effects": {
                        "relationship": {
                            "mom": 12,
                            "dad": 5
                        },
                        "authenticity": 5
                    },
                    "next": "dad_concern"
                }
            ]
        },
        "turkey_advice": {
            "speaker": "Mom",
            "text": "Oh he bought three thermometers! One for each... I don't know what the other two are for. Anyway, are you coming home for Thanksgiving?",
            "choices": [
                {
                    "text": "I'll try, Mom. Work is just really busy right now.",
                    "internal": "(\"I'll try\" is the adult child's \"we'll see.\")",
                    "effects": {
                        "relationship": {
                            "mom": -3
                        }
                    },
                    "next": "try"
                },
                {
                    "text": "Yeah. Yeah, I'll be there.",
                    "effects": {
                        "relationship": {
                            "mom": 15
                        },
                        "burnout": 5
                    },
                    "next": "commit"
                }
            ]
        },
        "call_back": {
            "speaker": "Mom",
            "text": "Oh! Of course, honey. You work so hard. I'm so proud of you. Call me when you can. Love you.",
            "internal": "(The voicemail she'll leave in 4 hours will be 6 minutes long. You'll listen to the first 30 seconds.)",
            "choices": [
                {
                    "text": "Love you too, Mom.",
                    "effects": {},
                    "next": "end_call_back"
                }
            ]
        },
        "dad_concern": {
            "speaker": "Mom",
            "text": "Oh, Dad's fine. You know how he is. He doesn't... he misses you. He won't say it. He reorganized the garage twice last month. That's how I know.",
            "internal": "(The garage. Dad's emotional support project.)",
            "choices": [
                {
                    "text": "Tell him I'll call him this week.",
                    "internal": "(You might actually do it this time.)",
                    "effects": {
                        "relationship": {
                            "dad": 8
                        }
                    },
                    "next": "end_dad"
                },
                {
                    "text": "Maybe I should visit soon.",
                    "effects": {
                        "relationship": {
                            "mom": 10,
                            "dad": 10
                        },
                        "burnout": 3
                    },
                    "next": "end_visit"
                }
            ]
        },
        "try": {
            "speaker": "Mom",
            "text": "Okay, sweetie. I understand. Jordan's coming. They ask about you, you know. ...Anyway, I should let you get back to work. Love you so much.",
            "effects": {},
            "end": true
        },
        "commit": {
            "speaker": "Mom",
            "text": "Really?! Oh that's wonderful! I'll tell your father! He'll — oh he's going to be so happy. He won't say it but he'll clean the guest room. That's how you'll know.",
            "effects": {},
            "end": true
        },
        "end_call_back": {
            "speaker": "Narrator",
            "text": "She'll call again next Sunday. And the Sunday after that. The streak of missed calls will hit 4 before you pick up again.",
            "effects": {},
            "end": true
        },
        "end_dad": {
            "speaker": "Mom",
            "text": "He'd like that. He really would. Okay, I'll let you go. Don't work too hard. ...Who am I kidding. Love you.",
            "effects": {},
            "end": true
        },
        "end_visit": {
            "speaker": "Mom",
            "text": "Oh honey... that would be so nice. Your room is exactly how you left it. I dusted it last week. ...I dust it every week. Okay, I need to go before I cry. Love you!",
            "effects": {},
            "end": true
        }
    }
}